<script setup lang="ts">
import { AiChamp } from '~/pages/ai_champ'

definePageMeta({ headerConfig: 'ai_champ' })

useHead({
  title: 'Всероссийский фестиваль по искусственному интеллекту и алгоритмическому программированию',
  meta: [
    {
      name: 'description',
      content:
        'Прокачай скиллы по искусственному интеллекту и программированию, заяви о себе на чемпионате и построй свою карьеру в IT на фестивале RuCode: бесплатные курсы и интенсивы, чемпионаты, конференции, HR-лекции и IT стажировки.',
    },
    {
      property: 'og:title',
      content:
        'Всероссийский фестиваль по искусственному интеллекту и алгоритмическому программированию',
    },
    {
      property: 'og:description',
      content:
        'Прокачай скиллы по искусственному интеллекту и программированию, заяви о себе на чемпионате и построй свою карьеру в IT на фестивале RuCode: бесплатные курсы и интенсивы, чемпионаты, конференции, HR-лекции и IT стажировки.',
    },
  ],
})
</script>

<template>
  <AiChamp />
</template>
